NikolayBobovnikov/ircapture/auvir_embed/mocap/transmitter/stm32f103/Src/main.c
}

/** Configure pins as 
        * Analog 
        * Input 
        * Output
        * EVENT_OUT
        * EXTI
*/
void MX_GPIO_Init(void)
{

  GPIO_InitTypeDef GPIO_InitStruct;

  /* GPIO Ports Clock Enable */
  __GPIOD_CLK_ENABLE();
  __GPIOA_CLK_ENABLE();
  __GPIOB_CLK_ENABLE();

  /// Other outputs
  /*Configure GPIO pin : PA4 */
  GPIO_InitStruct.Pin = GPIO_PIN_4;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : PA5 */
  GPIO_InitStruct.Pin = GPIO_PIN_5;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

}

/* USER CODE BEGIN 4 */
void send_data()
{
    // fill tx_data_frame with data

    // sample data. TODO: use actual one
    tx_data_frame._0_beamer_id = 0b1111111111111111;
    tx_data_frame._1_angle_graycode = 0b1111111111111111;
    tx_data_frame._2_timer32_value = 0b11111111111111111111111111111111;

    // just repetition of the same data for now.
    // TODO: send updated time
    if(TX_WAITING == TransmitterState)
    {
        TransmitterState = TX_START_BIT;
    }
    else
    {
        //TODO: handle this case
        // data is still being transmitted. Need to finish previous transmission before starting next one
    }
}
void transmit_handler()
{

    /// ensure carrier is not generating
    force_envelop_timer_output_off();  // stop carrier // TODO: check neseccity

    /* Send data frame
     * 1. start sequence
     * 2. data
     *  2.1 Coded angle
     *  2.2 Time of emission
     *  2.3 Beamer ID
     * 3. data redundancy (repeated, or use error correction code)
     * 4. stop sequence
     */
    // htim_envelop forming envelop
    // htim2 generates PWM

    switch(TransmitterState)
    {
        case TX_WAITING:
        {
            nop();
            break;
        }
        case TX_START_BIT:
        {
            phtim_envelop->Instance->ARR = PeriodOfStartStopBits;

            // Start sequence consists of signal sequence {1,0,1}
            switch(StartStopSequenceTransmitState)
            {
                    // High
                case STAGE_0:
                {
                    StartStopSequenceTransmitState = STAGE_ON1;
                    force_envelop_timer_output_on();
                    break;
                }
                    // Low
                case STAGE_ON1:
                {
                    StartStopSequenceTransmitState = STAGE_OFF;
                    force_envelop_timer_output_off(); //TODO done anyway in timer interrupt handler?
                    break;
                }
                    // High
                case STAGE_OFF:
                {
                    StartStopSequenceTransmitState = STAGE_ON2;
                    force_envelop_timer_output_on();
                    break;
                }
                   // Low
                case STAGE_ON2:
                {
                    TransmitterState = TX_DATA;
                    StartStopSequenceTransmitState = STAGE_0;
                    tx_current_byte_pos = 0;
                    tx_current_bit_pos = 0;
                    force_envelop_timer_output_off();
                    break;
                }
            }
            break;
        } 
        case TX_DATA:
        {
            phtim_envelop->Instance->ARR = PeriodOfDataBits;

            // process current byte from buffer
            if(tx_current_byte_pos < sizeof(DataFrame_t)) /// FIXME: check sizeof correctness.
            {
                // process current bit of current byte
                if(tx_current_bit_pos < tx_total_bits)
                {
                    //set PWM output channel according to current bit number
                    currentOutputTimChannel = input_channel_per_message_bit[tx_current_bit_pos];
                    // get k-th bit of n: (n >> k) & 1
                    //tx_bit = (tx_data >> (tx_total_bits - tx_current_bit_pos - 1)) & 1;
                    tx_bit = (((uint8_t* )&tx_data_frame)[tx_current_byte_pos] >> (tx_total_bits - tx_current_bit_pos - 1)) & 1;

                    if(tx_bit == 1)
                    {
                        force_envelop_timer_output_on();
                    }
                    else // bit == 0
                    {
                        force_envelop_timer_output_off();
                    }
                    // go to next bit
                    tx_current_bit_pos++;
                }// if(tx_current_bit_pos < tx_total_bits)
                else
                {
                    //go to next byte
                    tx_current_byte_pos++;
                    //reset current bit position
                    tx_current_bit_pos = 0;
                }
            }///if(tx_current_byte_pos < tx_buffer_size)
            else
            {\
                // sending data using separate PWM channels is finished,
                // return to default PWM channel
                currentOutputTimChannel = primary_output_channel;

                // move on to next stage
                // TransmitterState = TX_DATA_SENT;
                TransmitterState = TX_STOP_BIT;

                /* Set the Autoreload value for start sequence bits*/
                phtim_envelop->Instance->ARR = PeriodOfStartStopBits;
            }

            // TODO: check if some errors or other options are possible here?
            break;
        }
        case TX_STOP_BIT:
        {
            // TODO: check if worth to move ARR update to step abore

            // Start sequence consists of signal sequence {1,0,1}
            switch(StartStopSequenceTransmitState)
            {
                case STAGE_0:
                {
                    StartStopSequenceTransmitState = STAGE_ON1;
                    force_envelop_timer_output_on();
                    break;
                }
                case STAGE_ON1:
                {
                    StartStopSequenceTransmitState = STAGE_OFF;
                    force_envelop_timer_output_off();
                    break;
                }
                case STAGE_OFF:
                {
                    StartStopSequenceTransmitState = STAGE_ON2;
                    force_envelop_timer_output_on();
                    break;
                }

